IDEA Open Model
ReinfAroundOpening.DiagonalLength Property
 length of diagonal bar
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public double DiagonalLength { get; set; }
Public Property DiagonalLength As Double
	Get
	Set
public:
property double DiagonalLength {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
ReinfAroundOpening Class
IdeaRS.OpenModel.Detail Namespace